
## Plan Result (sendgrid-data-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/40951)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
  * aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476
* Replace
  * aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-02-07T15:00:36Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:1oyn6teaa0/" -> (known after apply)
      ~ id            = "2866bh" -> (known after apply)
      ~ invoke_url    = "https://1oyn6teaa0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1707317993904" -> "1707332595874"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "2866bh" -> (known after apply)
        id                    = "ags-1oyn6teaa0-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476 will be updated in-place
  ~ resource "aws_lambda_function" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476" {
        id                             = "SendGridData-Prod-ApiGateway-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function:30" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function:30/invocations" -> (known after apply)
      ~ runtime                        = "nodejs18.x" -> "nodejs20.x"
        tags                           = {}
      ~ version                        = "30" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"                           = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"a91ee8d8-d831-48b6-a517-c28c590a14a4","JobName":"sendgrid-data_infrastructure_plan_prod","PRNumber":156,"Program":"tfcmt","SHA1":"2f501317bb867855e7e49b98636a4423fc92f866","Target":"sendgrid-data-cdk","Vars":{}} -->